const russianBadWords = [
    "абассака", "азербон", "азербот", "алканавт", "алкаш", "америкос", "анально",
    "анаша", "анус", "армяшка", "ахуеть", "балда", "беспесды", "бздеть", "бзднуть",
    "бздун", "блин", "бля", "бляхамуха", "болван", "буфера", "бухарик", "бухать",
    "бухло", "быдло", "вагина", "вафлер", "вафлёр", "вафлёрка", "вмандячить",
    "въебать", "выебнулся", "гавно", "газенваген", "ганджа", "ганджубас", "гандон",
    "гашиш", "гей", "героин", "гнида", "говно", "говнюк", "гомик", "гомосек",
    "гомосятина", "гондон", "гунявый", "давалка", "дебил", "дерьмо", "дойки",
    "долбоеб", "драть", "дрочер", "дрочить", "дрючить", "дрянь", "дура", "дурак",
    "ёб", "ебака", "ебало", "ебальник", "ебанат", "ебанашка", "ебанный", "ебанутый",
    "ебаный", "ебань", "ебанько", "ебарь", "ебатня", "ебаторий", "ебать", "ебашить",
    "ебись", "ебическаясила", "еблан", "ебля", "ебнутый", "ебонат", "еботня",
    "ебошить", "ебун", "ебырь", "едрить", "елда", "епти", "ёпти", "жид", "жлоб",
    "жоп", "задница", "задрот", "заеб", "залуп", "засранец", "идиот", "иннах",
    "ипаться", "ипацца", "какать", "какашка", "каннабис", "китаеза", "китаёза",
    "клитор", "кобель", "кокаин", "кретин", "кунка", "курва", "лесбианка",
    "лесбиянка", "лох", "лошара", "лягавый", "макаронщик", "манда", "мандёжник",
    "мандохаться", "марихуана", "мерзавец", "минет", "москаль", "мохнатка", "мразь",
    "мудак", "муде", "муди", "мудоеб", "мудозвон", "мудохать", "мурло", "мусор",
    "наеб", "нахер", "нахуй", "нацист", "недомерок", "недоносок", "недоумок",
    "немчура", "нехуй", "нигга", "ниггер", "ниибацца", "ниибет", "ниибёт", "ниипет",
    "ниипёт", "нихера", "обалдуй", "оболтус", "обоссака", "олух", "опездал",
    "орально", "оргазм", "остолоп", "отмудохать", "отсос", "оттопыриваться",
    "отыбись", "охуеть", "падла", "пархатый", "паскуда", "паскудец", "педераст",
    "педик", "педофил", "педрила", "педрило", "пелотка", "пендос", "пендостан",
    "пенис", "пердануть", "пердёж", "пердеть", "перднуть", "пёрднуть", "пердун",
    "песда", "пидар", "пидераст", "пидор", "пидорас", "пидрила", "пизд", "пиндос",
    "пипец", "писька", "пнх", "подлец", "подонок", "подъебнуть", "поеб", "порево",
    "порн", "потаскуха", "похуист", "придурок", "проститутка", "проституция",
    "простодырка", "прошмандовка", "пукать", "разеб", "разъеб", "рожа", "рыло",
    "сволочь", "секс", "сиськи", "скотина", "сперма", "срака", "срань", "срать",
    "срачь", "ссать", "ссх", "старпер", "старпёр", "стерва", "сука", "сучка",
    "сцать", "сцука", "сцукко", "сцуко", "титьки", "трахать", "ублюдок", "уеб",
    "узкоглазый", "урод", "ушлепок", "ушлёпок", "фаллос", "фашист", "хyй", "харя",
    "хач", "хезать", "хер", "хмырь", "хохол"]


const ukrainianBadWords = [
    "пошлість",
    "мат",
    "образливе",

];


const englishBadWords = [
    "obscenity",
    "curse",
    "insult",

];

function validateRoomName(roomName) {
    const allBadWords = [...russianBadWords, ...ukrainianBadWords, ...englishBadWords];
    const wordsInRoomName = roomName.toLowerCase().split(/\s+/);
    for (let word of wordsInRoomName) {
        if (allBadWords.includes(word)) {
            return false;
        }
    }
    return true;
}